# pandas
used for basically data analysis such as data manipulation, data visualisation, building ML models
Panas Data Structures are..........Series(works as numpy array), Data Frame
Pandas is basically build on top of numpy array

# Pandas Series

In [86]:
import pandas as pd

In [87]:
#series() function works just like the np.array()
a = pd.Series([1,2,3,4,5])

In [88]:
a

0    1
1    2
2    3
3    4
4    5
dtype: int64

Here the 1st column represents as index & the 2nd column represents the value

In [89]:
#If we want to check the type of "a"
type(a)

pandas.core.series.Series

In [90]:
a[2]

3

In [91]:
a = pd.Series(['a','b','c'])

In [92]:
a

0    a
1    b
2    c
dtype: object

N.B: In Series() function if we store there string then it represent as 'OBJECT'

In [93]:
#If we want the date list 
a = pd.date_range(start = '01-01-2020', end = '07-05-2020')

In [94]:
a

DatetimeIndex(['2020-01-01', '2020-01-02', '2020-01-03', '2020-01-04',
               '2020-01-05', '2020-01-06', '2020-01-07', '2020-01-08',
               '2020-01-09', '2020-01-10',
               ...
               '2020-06-26', '2020-06-27', '2020-06-28', '2020-06-29',
               '2020-06-30', '2020-07-01', '2020-07-02', '2020-07-03',
               '2020-07-04', '2020-07-05'],
              dtype='datetime64[ns]', length=187, freq='D')

In [95]:
type(a)

pandas.core.indexes.datetimes.DatetimeIndex

# Pandas DataFrame

In [96]:
import numpy as np

In [97]:
temp = np.random.randint(low = 20, high = 100, size = [20,]) #That means 20 to 100 random values of 20 size
name = np.random.choice(['Faysal', 'Borshon', 'Nadia', 'Nodi'], 20) #That means these names are coming randomly 20 times
value = np.random.choice(['75','77','2','100'], 20)

Now we will zip all the variables to a list for making the DataFrame properly

In [98]:
#Data Frame with list
a = list(zip(temp, name, value))

In [99]:
df = pd.DataFrame(data = a, columns = ['Temp', 'Name', 'Value'])

In [100]:
df

    Temp     Name Value
0     77     Nodi   100
1     76   Faysal   100
2     57     Nodi   100
3     88   Faysal    75
4     32     Nodi     2
5     85   Faysal    77
6     23     Nodi   100
7     59    Nadia    77
8     25   Faysal     2
9     96     Nodi   100
10    65     Nodi   100
11    46  Borshon    75
12    45     Nodi    77
13    76   Faysal     2
14    32     Nodi    77
15    78   Faysal    77
16    93    Nadia    77
17    76   Faysal    77
18    80  Borshon     2
19    66     Nodi     2

In [101]:
type(df)

pandas.core.frame.DataFrame

In [102]:
#Data Frame with dictionary
df = pd.DataFrame({'temp':temp, 'Name':name, 'value':value})

In [103]:
df

    temp     Name value
0     77     Nodi   100
1     76   Faysal   100
2     57     Nodi   100
3     88   Faysal    75
4     32     Nodi     2
5     85   Faysal    77
6     23     Nodi   100
7     59    Nadia    77
8     25   Faysal     2
9     96     Nodi   100
10    65     Nodi   100
11    46  Borshon    75
12    45     Nodi    77
13    76   Faysal     2
14    32     Nodi    77
15    78   Faysal    77
16    93    Nadia    77
17    76   Faysal    77
18    80  Borshon     2
19    66     Nodi     2

In [104]:
#for initial 5 values
df.head()

   temp    Name value
0    77    Nodi   100
1    76  Faysal   100
2    57    Nodi   100
3    88  Faysal    75
4    32    Nodi     2

In [105]:
#For last 5 values
df.tail()

    temp     Name value
15    78   Faysal    77
16    93    Nadia    77
17    76   Faysal    77
18    80  Borshon     2
19    66     Nodi     2

In [106]:
#Dimension of Data Frame
df.shape

(20, 3)

In [107]:
df.columns

Index(['temp', 'Name', 'value'], dtype='object')

In [108]:
df.Name

0        Nodi
1      Faysal
2        Nodi
3      Faysal
4        Nodi
5      Faysal
6        Nodi
7       Nadia
8      Faysal
9        Nodi
10       Nodi
11    Borshon
12       Nodi
13     Faysal
14       Nodi
15     Faysal
16      Nadia
17     Faysal
18    Borshon
19       Nodi
Name: Name, dtype: object

In [109]:
#Another way to show column and most used way
df['Name']

0        Nodi
1      Faysal
2        Nodi
3      Faysal
4        Nodi
5      Faysal
6        Nodi
7       Nadia
8      Faysal
9        Nodi
10       Nodi
11    Borshon
12       Nodi
13     Faysal
14       Nodi
15     Faysal
16      Nadia
17     Faysal
18    Borshon
19       Nodi
Name: Name, dtype: object

In [110]:
#This will return all the statistics of temp column
df['temp'].describe()

count    20.00000
mean     63.75000
std      22.88156
min      23.00000
25%      45.75000
50%      71.00000
75%      78.50000
max      96.00000
Name: temp, dtype: float64

In [111]:
#To know all the information of Data Frame
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   temp    20 non-null     int32
 1   Name    20 non-null     object
 2   value   20 non-null     object
dtypes: int32(1), object(2)
memory usage: 528.0+ bytes

In [112]:
df.values

array([[77, 'Nodi', '100'],
       [76, 'Faysal', '100'],
       [57, 'Nodi', '100'],
       [88, 'Faysal', '75'],
       [32, 'Nodi', '2'],
       [85, 'Faysal', '77'],
       [23, 'Nodi', '100'],
       [59, 'Nadia', '77'],
       [25, 'Faysal', '2'],
       [96, 'Nodi', '100'],
       [65, 'Nodi', '100'],
       [46, 'Borshon', '75'],
       [45, 'Nodi', '77'],
       [76, 'Faysal', '2'],
       [32, 'Nodi', '77'],
       [78, 'Faysal', '77'],
       [93, 'Nadia', '77'],
       [76, 'Faysal', '77'],
       [80, 'Borshon', '2'],
       [66, 'Nodi', '2']], dtype=object)

In [113]:
#Make any particular column to index
df.set_index('temp')

         Name value
temp
77       Nodi   100
76     Faysal   100
57       Nodi   100
88     Faysal    75
32       Nodi     2
85     Faysal    77
23       Nodi   100
59      Nadia    77
25     Faysal     2
96       Nodi   100
65       Nodi   100
46    Borshon    75
45       Nodi    77
76     Faysal     2
32       Nodi    77
78     Faysal    77
93      Nadia    77
76     Faysal    77
80    Borshon     2
66       Nodi     2

In [114]:
df

    temp     Name value
0     77     Nodi   100
1     76   Faysal   100
2     57     Nodi   100
3     88   Faysal    75
4     32     Nodi     2
5     85   Faysal    77
6     23     Nodi   100
7     59    Nadia    77
8     25   Faysal     2
9     96     Nodi   100
10    65     Nodi   100
11    46  Borshon    75
12    45     Nodi    77
13    76   Faysal     2
14    32     Nodi    77
15    78   Faysal    77
16    93    Nadia    77
17    76   Faysal    77
18    80  Borshon     2
19    66     Nodi     2

In [115]:
#For making the change permanently 

df.set_index('temp', inplace = True)

#inplace is by default False to make it permanently change I have to change inplace in True

'inplace is by default False to make it permanently\nchange I have to change inplace in True'

In [116]:
df

         Name value
temp
77       Nodi   100
76     Faysal   100
57       Nodi   100
88     Faysal    75
32       Nodi     2
85     Faysal    77
23       Nodi   100
59      Nadia    77
25     Faysal     2
96       Nodi   100
65       Nodi   100
46    Borshon    75
45       Nodi    77
76     Faysal     2
32       Nodi    77
78     Faysal    77
93      Nadia    77
76     Faysal    77
80    Borshon     2
66       Nodi     2

In [117]:
#Sorting the temp index in descending order
df.sort_index(axis = 0, ascending = False)

         Name value
temp
96       Nodi   100
93      Nadia    77
88     Faysal    75
85     Faysal    77
80    Borshon     2
78     Faysal    77
77       Nodi   100
76     Faysal   100
76     Faysal    77
76     Faysal     2
66       Nodi     2
65       Nodi   100
59      Nadia    77
57       Nodi   100
46    Borshon    75
45       Nodi    77
32       Nodi    77
32       Nodi     2
25     Faysal     2
23       Nodi   100

In [118]:
#For dropping any particular column
df.drop(['value'], axis = 1)

#Value is sitting by default in a column not in a row. For dropping the value column I need to change the axis in 1 as it is by default axis = 0

         Name
temp
77       Nodi
76     Faysal
57       Nodi
88     Faysal
32       Nodi
85     Faysal
23       Nodi
59      Nadia
25     Faysal
96       Nodi
65       Nodi
46    Borshon
45       Nodi
76     Faysal
32       Nodi
78     Faysal
93      Nadia
76     Faysal
80    Borshon
66       Nodi